# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [4, 5, 1, 2, 3]

# k = 4
# [2, 3, 4, 5, 1]
# k = 5
# [1, 2, 3, 4, 5]
# k = k % n
# 13 : 5 = 2 (ост. 3)

data = [int(i) for i in input("Введите числа: ").split()]
steps = int(input("Введите кол-во сдвигов: "))
steps = steps % len(data)
data = [data[i - steps] for i in range(len(data))]
print(data)

# i = 0: data[0 - 3]
# i = 1: data[1 - 3]
# i = 2: data[2 - 3]
# i = 3: data[3 - 3]
# i = 4: data[4 - 3]


# [10, 20, 30, 40, 50]
#  -5  -4  -3  -2  -1
# steps = 3
# [30, 40, 50, 10, 20]
#  -3  -2  -1  -5  -4
#  0   1   2   3   4